nxp-mcuxpresso/mcux-soc-svd/LPC5502CPXXXX/LPC5502CPXXXX.xml
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN27_SEC_MASK</name>
              <description>Secure mask for pin P1_27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN28_SEC_MASK</name>
              <description>Secure mask for pin P1_28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN29_SEC_MASK</name>
              <description>Secure mask for pin P1_29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN30_SEC_MASK</name>
              <description>Secure mask for pin P1_30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIO1_PIN31_SEC_MASK</name>
              <description>Secure mask for pin P1_31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Pin state is blocked to non-secure world.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READABLE</name>
                  <description>Pin state is readable by non-secure world.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_MASK_LOCK</name>
          <description>Security General Purpose register access control.</description>
          <addressOffset>0xFBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAA</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>SEC_GPIO_MASK0_LOCK</name>
              <description>SEC_GPIO_MASK0 register write-lock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_GPIO_MASK1_LOCK</name>
              <description>SEC_GPIO_MASK1 register write-lock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_LEVEL</name>
          <description>master secure level register</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDMA0</name>
              <description>System DMA 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASH</name>
              <description>Hash.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMA1</name>
              <description>System DMA 1 security level.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD</name>
              <description>CAN FD.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER_SEC_LEVEL_LOCK</name>
              <description>MASTER_SEC_LEVEL write-lock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_ANTI_POL_REG</name>
          <description>master secure level anti-pole register</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xBFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDMA0</name>
              <description>System DMA 0. Must be equal to NOT(MASTER_SEC_LEVEL.SDMA0)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASH</name>
              <description>Hash. Must be equal to NOT(MASTER_SEC_LEVEL.HASH)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMA1</name>
              <description>System DMA 1 security level. Must be equal to NOT(MASTER_SEC_LEVEL.SDMA1)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD</name>
              <description>CAN FD. Must be equal to NOT(MASTER_SEC_LEVEL.CANFD)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_S_P</name>
                  <description>Secure and Priviledge user access allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_S_NP</name>
                  <description>Secure and Non-priviledge user access allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_P</name>
                  <description>Non-secure and Privilege access allowed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_NS_NP</name>
                  <description>Non-secure and Non-priviledge user access allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASTER_SEC_LEVEL_ANTIPOL_LOCK</name>
              <description>MASTER_SEC_ANTI_POL_REG register write-lock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU0_LOCK_REG</name>
          <description>Miscalleneous control signals for in Cortex M33 (CPU0)</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800002AA</resetValue>
          <resetMask>0xC00003FF</resetMask>
          <fields>
            <field>
              <name>LOCK_NS_VTOR</name>
              <description>Cortex M33 (CPU0) VTOR_NS register write-lock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_NS_MPU</name>
              <description>Cortex M33 (CPU0) non-secure MPU register write-lock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_S_VTAIRCR</name>
              <description>Cortex M33 (CPU0) VTOR_S, AIRCR.PRIS, IRCR.BFHFNMINS registers write-lock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_S_MPU</name>
              <description>Cortex M33 (CPU0) Secure MPU registers write-lock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_SAU</name>
              <description>Cortex M33 (CPU0) SAU registers write-lock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_LOCK_REG_LOCK</name>
              <description>CPU0_LOCK_REG write-lock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Restricted mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITABLE</name>
                  <description>Writable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
