nxp-mcuxpresso/mcux-soc-svd/LPC5502CPXXXX/LPC5502CPXXXX.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SCnSCB</name>
      <description>no description available</description>
      <groupName>SCNSCB</groupName>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CPPWR</name>
          <description>Coprocessor Power Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SU0</name>
              <description>State UNKNOWN 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS0</name>
              <description>State UNKNOWN Secure only 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU0 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU0 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU1</name>
              <description>State UNKNOWN 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS1</name>
              <description>State UNKNOWN Secure only 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU7 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU7 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU2</name>
              <description>State UNKNOWN 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS2</name>
              <description>State UNKNOWN Secure only 2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU2 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU2 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU3</name>
              <description>State UNKNOWN 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS3</name>
              <description>State UNKNOWN Secure only 3.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU3 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU3 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU4</name>
              <description>State UNKNOWN 4.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS4</name>
              <description>State UNKNOWN Secure only 4.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU4 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU4 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU5</name>
              <description>State UNKNOWN 5.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS5</name>
              <description>State UNKNOWN Secure only 5.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU5 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU5 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU6</name>
              <description>State UNKNOWN 6.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS6</name>
              <description>State UNKNOWN Secure only 6.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU6 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU6 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU7</name>
              <description>State UNKNOWN 7.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The coprocessor state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The coprocessor state is permitted to become UNKNOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS7</name>
              <description>State UNKNOWN Secure only 7.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU7 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU7 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU10</name>
              <description>State UNKNOWN 10.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNKNOWN_NOT_PERMITTED</name>
                  <description>The floating-point state is not permitted to become UNKNOWN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNKNOWN_PERMITTED</name>
                  <description>The floating-point state is permitted to become UNKNOWN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUS10</name>
              <description>State UNKNOWN Secure only 10.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE_AND_NON_SECURE</name>
                  <description>The SU10 field is accessible from both Security states.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_ONLY</name>
                  <description>The SU10 field is only accessible from the Secure state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SU11</name>
              <description>State UNKNOWN 11.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUS11</name>
              <description>State UNKNOWN Secure only 11.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
